decode_sys_states=(
    '检修状态',
    '井道自学习状态',
    '微动平层',
    '消防返基站状态',
    '消防运行状态',
    '故障状态',
    '司机操作状态',
    '自动运行状态',
    '锁梯状态',
    '泊梯状态',
    '故障或平层状态',
    '检修速度平层状态'
)

decode_car_states=(
    '轿厢等待指令',
    '轿厢开门',
    '轿厢开门维持',
    '轿厢关门',
    '轿厢关门到位',
    '轿厢正在运行',
    '轿厢停车'
)

decode_control_states=(
    '',
    '电梯上行',
    '电梯下行',
    '停机'
)

decode_err_states=(
'无故障',      #0
'逆变单元保护',       #1
'加速过电流',       #2
'减速过电流',       #3
'恒速过电流',       #4
'加速过电压',       #5
'减速过电压',       #6
'恒速过电压',       #7
'控制电源故障',       #8
'欠电压故障',       #9
'变频器过载',       #10
'电机过载',       #11
'输入侧缺相',       #12
'输出侧缺相',       #13
'模块过热',       #14
'',       #15
'',       #16
'接触器故障1',       #17
'电流检测故障',       #18
'电机调谐故障',       #19
'码盘故障',       #20
'数据溢出',       #21
'',       #22
'对地短路故障',       #23
'',       #24
'',       #25
'',       #26
'',       #27
'',       #28
'',       #29
'电梯位置异常',       #30
'DPRAM故障',       #31
'CPU故障',       #32
'超速故障',       #33
'逻辑故障',       #34
'自学习故障',       #35
'接触器故障2',       #36
'抱闸故障',       #37
'控制器码盘信号异常',       #38
'电机过热',       #39
'电梯运行条件不满足',       #40
'安全开关断开',       #41
'运行中门锁断开',       #42
'上限位断开',       #43
'下限位断开',       #44
'上下减速开关异常',       #45
'再平层异常',       #46
'封门接触器故障',       #47
'开门故障',       #48
'关门故障',       #49
'群控通讯故障',       #50
'内招通讯故障',       #51
'外招通讯故障',       #52
'门锁短接故障'       #53
)